[{"CandidateSLEOP_ID":"40","FirstName":"John","MiddleName":"","SurName":"Karimu","PoliticalParty":"National Unity Party (NUP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EJohn Arouna Karimu is a Mende hailed from Daru Village, Kailahun District, in the Eastern Region of Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EHe was a Lecturer at Fourah Bay College, where he met his wife Gertrude Gbessay Karimu née Sellu who was a student there as well. He later worked for the Bo\/Pujehun Project. He then became the Director of CUSO in Gambia.\u003C\/p\u003E\n\u003Cp\u003EHe later became the Finance Minister in Sierra Leone during the military rule of Valentine Strasser (1993-1996). He was the presidential candidate of the National Unity Party in the 1996 national elections. In that election, Karimu received 5.3% of the national vote and lost easily to Ahmed Tejan Kabbah. In December 1996, Karimu accepted a position in the cabinet of Kabbah as the Secretary of Housing and Environment. However, Karimu was eventually deposed, along with the rest of the government, when Major Johnny Paul Koroma overthrew the government on 25 May 1997. During this period, he worked as a Director with The World Bank in Papua New Guinea. He later became the Commissioner of the National Revenue Authority(NRA)-The highest paid civil Servant in Sierra Leone.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"06a94065-3c97-40f6-8c5b-1ba0ee174108","CandidateFullname":"John Karimu","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"86","FirstName":"Kandeh","MiddleName":"Baba","SurName":"Conteh","PoliticalParty":"Peace and Liberation Party (PLP)","ElectionYear":"2018-03-07, 2012-11-17, 2007-08-11","ElectionType":"Presidential","Profile":"\u003Cp\u003EDr. Kandeh Baba Conteh (born October 15, 1958) is a Sierra Leonean politician and political scientist. He is the leader of the Peace and Liberation Party (PLP).\u003C\/p\u003E\n\u003Cp\u003EConteh was appointed ambassador of the Armed Forces Revolutionary Council junta in 1997.\u003C\/p\u003E\n\u003Cp\u003EConteh, as the PLP candidate, placed sixth in the presidential election held on August 11, 2007, receiving 0.57% of the vote.  Following the first round, on August 27 Conteh announced his party\u0027s support for second place candidate Solomon Berewa of the ruling Sierra Leone People\u0027s Party (SLPP) in the second round of the election. With the All People\u0027s Congress (APC) of Berewa\u0027s rival, Ernest Bai Koroma, having already won a majority in the parliamentary election held concurrently with the first round, Conteh said that there would be \u0022a better balance\u0022 for the country if the presidency and parliament were controlled by different parties.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/dr-baba-kandeh.jpg","CandidateSLEOP_UUID":"b05244f0-98f8-4680-b781-4c75d6a2c830","CandidateFullname":"Kandeh  Baba Conteh","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"323","FirstName":"Andrew","MiddleName":"Duramany","SurName":"Turay","PoliticalParty":"Young People\u0026#039;s Party (YPP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAndrew Turay\u003C\/strong\u003E is a Sierra Leonean politician. He competed in the 1996 presidential election as part of the National People\u0027s Party (NPP). He received 0.5% of the vote (3,925 total votes).\u003C\/p\u003E\n\u003Cp\u003ETuray was the candidate for the Convention People\u0027s Party in the August 2007 presidential election. He received fourth place and 1.56% of the vote. In early September, prior to the second round of the election, he announced his support for Solomon Berewa of the Sierra Leone People\u0027s Party (SLPP).\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"c3dbfff3-7dd0-43e9-9881-002798edbeeb","CandidateFullname":"Andrew Duramany Turay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"41","FirstName":"Thaimu","MiddleName":"","SurName":"Bangura","PoliticalParty":"People\u0026#039;s Democratic Party (PDP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EThaimu Bangura (died 1999) was a politician from Sierra Leone. He was a government minister from 1980 to 1982 and again from 1996 to 1999. From 1991 to 1999, Bangura was the National Leader of the People\u0027s Democratic Party of Sierra Leone as well as their presidential candidate in the 1996 elections. In that election, Bangura finished 3rd behind winner and current president Ahmad Tejan Kabbah of the SLPP and John Karefa-Smart of the UNPP with 16.07% of the initial round of voting. He did not qualify for the run-off election. He was Minister of Finance of Sierra Leone from March 1996 to May 1997.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-1.png","CandidateSLEOP_UUID":"944b8117-bd7b-4678-885b-5cd237d9ecb8","CandidateFullname":"Thaimu Bangura","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"87","FirstName":"Femi","MiddleName":"Claudius","SurName":"Cole","PoliticalParty":"Unity Party (UP)","ElectionYear":"2018-03-07","ElectionType":"Presidential, Parliamentary","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/Femi-Claudius-Cole%20.jpg","CandidateSLEOP_UUID":"092005c3-2332-4c48-b3f9-46d0b679b46a","CandidateFullname":"Femi Claudius Cole","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Female","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"324","FirstName":"Abdul","MiddleName":"Karim","SurName":"Karim","PoliticalParty":"United National People\u0026#039;s Party (UNPP)","ElectionYear":"2007-08-11","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAbdul Kady Karim\u003C\/strong\u003E (died 12 or 13 November 2014) was a Sierra Leonean politician, accountant and academic. He was a member of the United National People\u0027s Party (UNPP). He ran for President in Sierra Leone\u0027s August 2007 general election and finished in 7th place with 7,260 votes (.39 percent of total votes) nationally.\u003C\/p\u003E\n\u003Cp\u003EHe joined the UNPP as a member in 2001. He was elected leader of the party in 2006 at its convention in Freetown. Upon election he stated \u0022It will not be easy to reverse these ills that the APC and the SLPP have afflicted on this nation, but we can do it together, it will require an equality of sacrifice not a sacrifice of equality.\u0022\u003C\/p\u003E\n\u003Cp\u003EHe resigned as a leader from the party in 2010; in 2012 it was necessary for him to deny the accuracy of a press report indicating that he was still chairman and leader of the UNPP.\u003C\/p\u003E\n\u003Cp\u003EHe died in Maryland, in the United States, in November 2014; his death may have related to knee surgery he underwent several months before. It was noted that \u0022The late professor acted as head of many family homes within his family circles who depended on him for their livelihood.\u0022\u003C\/p\u003E\n\u003Cp\u003EAn obituary stated: \u0022The late Professor is a father whose determination was to serve his country of birth by creating jobs and change the political landscape by joining the political race.\u0022\u003C\/p\u003E\n\u003Ch5\u003EEducation\u003C\/h5\u003E\n\u003Cp\u003EKarim, an accountant by trade, was educated at George Washington University. He has taught his trade at Bowie State University, Southeastern University, and Strayer University, the last being his occupation at the time of the 2007 presidential election.\u003C\/p\u003E\n\u003Ch5\u003EFamily\u003C\/h5\u003E\n\u003Cp\u003EKarim had 6 children, which were evenly split between Sierra Leone and the United States. His wife was currently employed by the United States State Department in the Voice of America - Africa.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"9e80ccde-9580-411d-81c6-392eaa52b977","CandidateFullname":"Abdul Kady Karim","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"42","FirstName":"Edward","MiddleName":"","SurName":"Kargbo","PoliticalParty":"People\u0026#039;s National Convention (PNC)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EEdward Kargbo (born January 24, 1963) is a politician in Sierra Leone. He ran for President in 1996 but lost with 2.1% of the national vote.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"0fab93b4-e761-4268-9ff2-932375cf1f80","CandidateFullname":"Edward Kargbo","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"88","FirstName":"Saa","MiddleName":"Henry","SurName":"Kabuta","PoliticalParty":"United National People\u0026#039;s Party (UNPP)","ElectionYear":"2023-06-24, 2018-03-07","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/saa-heny-kabuta.jpg","CandidateSLEOP_UUID":"8993d0bb-b02c-4de3-a130-2a5ef195670a","CandidateFullname":"Saa Henry Kabuta","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"354","FirstName":"Solomon","MiddleName":"Ekuma Dominic","SurName":"Berewa","PoliticalParty":"Sierra Leone Peoples Party (SLPP)","ElectionYear":"2007-08-11","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003ESolomon Ekuma Dominic Berewa\u003C\/strong\u003E (6 August 1938 – 5 March 2020) was Vice-President of Sierra Leone from May 2002 to September 2007. Standing as the candidate of the Sierra Leone People\u0027s Party (SLPP), he was defeated in the second round of the 2007 presidential election by Ernest Bai Koroma of the All People\u0027s Congress (APC).\u003C\/p\u003E\n\u003Ch5\u003ELife and career\u003C\/h5\u003E\n\u003Cp\u003EBerewa was born in 1938 in Bumpe Chiefdom, Bo District.\u003C\/p\u003E\n\u003Cp\u003EUnder President Ahmed Tejan Kabbah, Berewa was Attorney-General and Minister of Justice from 1996[3] to 1997, when the government was ousted in a coup. After Kabbah was restored to power, Berewa was Attorney-General and Minister of Justice again from 1998 to May 2002. He then became Vice-President.\u003C\/p\u003E\n\u003Cp\u003EAt the SLPP\u0027s national convention in Makeni on September 3–4, 2005, Berewa was selected by the SLPP as its leader and its 2007 presidential candidate. He received 291 votes, while Charles Margai received 34, Julius Maada Bio received 33, and J. B. Dauda received 28.\u003C\/p\u003E\n\u003Cp\u003EIn the first round of the 2007 presidential election, held on August 11, Berewa took second place with 38.3% of the vote, behind Koroma, the candidate of the opposition APC, who won 44.3%. A second-round between Berewa and Koroma was held on September 8, and on September 17 Koroma was declared the winner, with 54.6% of the vote against 45.4% for Berewa. Berewa promptly conceded defeat, and Koroma was sworn in later on the same day at a ceremony at which Berewa was present.\u003C\/p\u003E\n\u003Cp\u003EIn keeping with the SLPP constitution, which requires its leader to resign if the party loses a national election under his leadership, Berewa resigned as party leader on October 17, 2007.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/solomon-berewa.webp","CandidateSLEOP_UUID":"c0b6ee2f-4a60-48d0-b5d6-eeab6615a96c","CandidateFullname":"Solomon Ekuma Dominic Berewa","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"43","FirstName":"Abass","MiddleName":"","SurName":"Bundu","PoliticalParty":"People\u0026#039;s Progressive Party (PPP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAbass Chernor Bundu\u003C\/strong\u003E (born 1948 in Gbinti, Port Loko District) is a Sierra Leonean politician, diplomat, and the current Speaker of the Sierra Leone House of Parliament, in office since April 25, 2018. Bundu was elected speaker by receiving 70 votes in Parliament. The main opposition the All People\u0027s Congress, which won the most seats in Parliament, boycotted the election process in protest and did not nominate a candidate for speaker Archived 26 April 2018 at the Wayback Machine. Bundu is a veteran politician, and a very close ally and personal friend of Sierra Leone\u0022s president Julius Maada Bio\u003C\/p\u003E\n\u003Cp\u003EBefore being elected speaker, Bundu was the northern regional chairman of the Sierra Leone People\u0027s Party (SLPP). He is one of the most senior and one of the most influential members of the ruling Sierra Leone People\u0027s Party\u003C\/p\u003E\n\u003Cp\u003EBundu is the older brother of Ibrahim Bundu, a member of Parliament of the main opposition All People\u0027s Congress.\u003C\/p\u003E\n\u003Cp\u003EFrom 1989 to 1993, Bundu was the executive secretary of the Economic Community of West African States. Bundu was the head of several ministries in Sierra Leone, including Foreign Affairs and Agriculture. He was the presidential candidate of the now defunct Progressive People\u0027s Party (PPP) in the 1996 Sierra Leone presidential election, where he was defeated in the first round of voting after winning 2.9% of the votes.\u003C\/p\u003E\n\u003Cp\u003EBundu holds a Bachelor of Laws degree from the Australian National University and both a Master of Laws and a PhD in International Law from the University of Cambridge in England.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EEarly life\u003C\/strong\u003E\u003Cbr \/\u003EAbass Chernor Bundu was born in the rural town of Gbinti, Port Loko District in the Northern Province of Sierra Leone. Bundu was born into a prominent Bundu Family who are of Fula and Temne descents. Abass Bundu grew up in a deeply religious Muslim household and he is a devout Muslim.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EEducation\u003C\/strong\u003E\u003Cbr \/\u003EBundu attended the St. Andrews Secondary School in Bo, the Methodist Boys\u0027 High School in Freetown and the St. Edward\u0027s Secondary School also in Freetown. While in secondary school, Bundu was a very brilliant student and he was highly admired by his fellow students and teachers.\u003C\/p\u003E\n\u003Cp\u003EImmediately after secondary school, Bundu left Sierra Leone as a youth and moved abroad to further his education. He holds a Bachelor of Laws degree from the Australian National University and both a Master of Laws and a PhD in International Law from the University of Cambridge, England. He is also a Barrister-at-Law.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003ECareer\u003C\/strong\u003E\u003Cbr \/\u003EBundu\u0027s numerous positions include Assistant Director of International Affairs and Consultant in Constitutional Law in the Commonwealth Secretariat in London from 1975–82; Executive Secretary of Economic Community of West African States (ECOWAS) from 1989–1993, the posts of Foreign Minister (1994–1995), Minister of Agriculture 1982–85; and Presidential candidate in the 1996 Presidential election in Sierra Leone. Bundu failed to garner much support in the election, gaining just under 30,000 votes or 2.9% of the national vote. He is an expert on West African affairs and a renowned expert on constitutional and international law. Bundu has written a critical analysis of the Civil War in Sierra Leone, Democracy by Force?\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EOpposition to President Momoh\u003C\/strong\u003E\u003Cbr \/\u003EIn 1991, Dr. Bundu strongly criticised President Joseph Saidu Momoh\u0027s government because of clauses their party wished to add to Sierra Leone\u0027s constitution. He was then forced to leave the All People\u0027s Congress (APC).\u003C\/p\u003E\n\u003Cp\u003EDr. Bundu contested the 1996 elections as not democratically free and fair.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EPresidential campaign\u003C\/strong\u003E\u003Cbr \/\u003EIn 1996, Bundu formed his own political party and ran for president in Sierra Leone. His bid was unsuccessful.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EAlleged corruption and exoneration\u003C\/strong\u003E\u003Cbr \/\u003EIn 1996 Bundu was prosecuted for alleged illegal sale of Sierra Leone passports under the immigration investment programme. In October 2005 Government of Sierra Leone dropped the prosecution and publicly exonerated Bundu of any wrongdoing based on new evidence which, had it been available in 1996, would not have given rise to any prosecution.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/abass-bundu.png","CandidateSLEOP_UUID":"8ef684f3-ecb5-4441-8608-9bccbfcdef2c","CandidateFullname":"Abass Bundu","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"89","FirstName":"Beresford","MiddleName":"Victor","SurName":"Williams","PoliticalParty":"Republic National Independent Party (ReNIP)","ElectionYear":"2023-06-24, 2018-03-07","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-06\/beresford-victor-williams-photo.jpg","CandidateSLEOP_UUID":"c14d929e-81d3-4220-845d-ef2180ec5590","CandidateFullname":"Beresford Victor Williams","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"367","FirstName":"Andrew","MiddleName":"","SurName":"Turay","PoliticalParty":"Convention People\u0026#039;s Party (CPP)","ElectionYear":"2007-08-11","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAndrew Turay\u003C\/strong\u003E is a Sierra Leonean politician. He competed in the 1996 presidential election as part of the National People\u0027s Party (NPP). He received 0.5% of the vote (3,925 total votes).\u003C\/p\u003E\n\u003Cp\u003ETuray was the candidate for the Convention People\u0027s Party in the August 2007 presidential election. He received fourth place and 1.56% of the vote. In early September, prior to the second round of the election, he announced his support for Solomon Berewa of the Sierra Leone People\u0027s Party (SLPP).\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"cf0c4c6c-5ab9-4ae5-8a60-627be244e2bc","CandidateFullname":"Andrew Turay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"44","FirstName":"Andrew","MiddleName":"","SurName":"Lungay","PoliticalParty":"Social Democratic Party (SDP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EAndrew Victor Lungay (born May 16, 1942) is a Sierra Leonean politician from the Sierra Leone People\u0027s Party (SLPP). He is a member of parliament of Sierra Leone from Kenema District since 2002.\u003C\/p\u003E\n\u003Cp\u003ELungay ran in the 1996 presidential election as a member of the Social Democratic Party, receiving .7% of the national vote. An interesting note on that election is Lungay and Andrew Turay, the 2 worst finishers in the election, had equal numbers of votes from all the regions, something the top-finishers could not claim. Lungay has been a member of the Parliamentary Education, Social Services, Youths \u0026amp; Sports, Human Rights and Internal Affairs committees.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"77b66500-c1a3-4d20-a9b6-151894bb215a","CandidateFullname":"Andrew Lungay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"90","FirstName":"Jonathan","MiddleName":"Patrick","SurName":"Sandy","PoliticalParty":"National Unity and Reconciliation Party (NURP)","ElectionYear":"2023-06-24, 2018-03-07","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-06\/jonathan-sandy-photo.jpg","CandidateSLEOP_UUID":"72e39d90-0324-4936-bf38-2ea5f0f1cc91","CandidateFullname":"Jonathan Patrick Sandy ","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"4736","FirstName":"Prince","MiddleName":"","SurName":"Coker","PoliticalParty":"People\u0026#039;s Democratic Party (PDP)","ElectionYear":"2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-05\/prince-coker-pdp.jpg","CandidateSLEOP_UUID":"9d9c43ec-adfc-4a59-ab9f-704b1e748e66","CandidateFullname":"Prince Coker","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"45","FirstName":"Ahmad","MiddleName":"Tejan","SurName":"Kabbah","PoliticalParty":"Sierra Leone Peoples Party (SLPP)","ElectionYear":"2002-05-14, 1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAlhaji Ahmad Tejan Kabbah\u003C\/strong\u003E (February 16, 1932 – March 13, 2014) was a Sierra Leonean politician who served twice as the 3rd President of Sierra Leone, from 1996 to 1997 and again from 1998 to 2007. An economist and attorney by profession, Kabbah spent many years working for the United Nations Development Programme. He retired from the United Nations and returned to Sierra Leone in 1992.\u003C\/p\u003E\n\u003Cp\u003EIn early 1996, Kabbah was elected leader of the Sierra Leone People\u0027s Party (SLPP) and was the party\u0027s presidential candidate in the country\u0027s first free presidential election later that year. He was elected with 59% of the vote, defeating his closest rival, John Karefa-Smart of the United National People\u0027s Party (UNPP), who had 40% in the runoff vote and conceded defeat. International observers declared the election free and fair. Kabbah campaigned on a promise to end the civil war if elected president. During his inauguration speech as president, Kabbah repeated he promised to end the civil war, which he indeed achieved later in his presidency.\u003C\/p\u003E\n\u003Cp\u003EA deeply devoted Muslim, Kabbah was born in Pendembu, Kailahun District in Eastern Sierra Leone, though he was raised in the capital Freetown. Kabbah was an ethnic Mandingo. Kabbah was Sierra Leone\u0027s first and currently the only Muslim head of state of the country.\u003C\/p\u003E\n\u003Cp\u003EKabbah\u0027s first marriage, in 1965, was to Patricia Tucker, a devout Christian from the Sherbro ethnic group and a native of Bonthe District in Southern Sierra Leone. He and Patricia Kabbah had five children. The two were often seen together in public before his presidency. She was very influential during his presidency, focusing mainly on humanitarian issues, and was outspoken on the need to end the civil war. She died from an illness in 1998 and thus did not live to see the war\u0027s end in 2002.\u003C\/p\u003E\n\u003Cp\u003EA year after he left office as president, and ten years after the death of his wife Patricia, Kabbah married Isata Jabbie Kabbah, an ethnic Mandingo and a Muslim in an Islamic wedding ceremony in Freetown. They remained married until he died in 2014.\u003C\/p\u003E\n\u003Cp\u003EMost of Kabbah\u0027s time in office was influenced by the civil war with the Revolutionary United Front, led by Foday Sankoh, which led to him being temporarily ousted by the military Armed Forces Revolutionary Council from May 1997 to March 1998. He was soon returned to power after military intervention by the Economic Community of West African States (ECOWAS), led by Nigeria. Another phase of the civil war led to the United Nations and British involvement in the country in 2000.\u003C\/p\u003E\n\u003Cp\u003EAs President, Kabbah opened direct negotiations with the RUF rebels to end the civil war. He signed several peace accords with the rebel leader Foday Sankoh, including the 1999 Lomé Peace Accord, in which the rebels, for the first time, agreed to a temporary ceasefire with the Sierra Leone government. When the cease-fire agreement with the rebels collapsed, Kabbah campaigned for international assistance from the British, the United Nations Security Council, the African Union and the Economic Community of West African States to help defeat the rebels and restore peace and order in Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EKabbah declared the civil war officially over in early 2002. Tens of thousands of Sierra Leoneans across the country took to the streets to celebrate the end of the war. Kabbah went on to easily win his final five-year term in office in the presidential election later that year, defeating his main opponent Ernest Bai Koroma of the main opposition All People\u0027s Congress (APC) with 70.1% of the vote–the largest margin of victory for a free election in the country\u0027s history. International observers declared the election free and fair.\u003C\/p\u003E\n\u003Ch5\u003EBackground\u003C\/h5\u003E\n\u003Cp\u003E\u003Cstrong\u003EYouth and education\u003C\/strong\u003E\u003Cbr \/\u003EAlhaji Ahmad Tejan Kabbah was born on February 16, 1932, in the rural town of Pendembu, Kailahun District in the Eastern Province of British Sierra Leone. Kabbah\u0027s father, Abu Bakr Sidique Kabbah, who worked as a businessman and a deeply religious Muslim man, was an ethnic Mandingo of Guinean descent from Kambia District in northern Sierra Leone.[4] Kabbah\u0027s mother, Haja Adama Coomber Kabbah, was also a deeply religious Muslim and a member of the Mende ethnic group from the Coomber family, a Chieftaincy ruling house based in the rural town of Mobai, Kailahun District in eastern Sierra Leone. A devoted Muslim himself, Kabbah\u0027s first name Ahmad means \u0022highly praised\u0022 or \u0022one who constantly thanks God\u0022 in Arabic language. Kabbah was a fluent speaker of several languages including English, French, Susu, Mende, Krio and his native Mandinka language.[5] Though born in the Kailahun District, Kabbah grew up in the capital, Freetown.\u003C\/p\u003E\n\u003Cp\u003EThough a devoted Muslim, Kabbah received his secondary education at the St. Edward\u0027s Secondary School, the oldest catholic secondary school in Freetown. He also married a Catholic, the late Patricia Kabbah, who was an ethnic Sherbro from Bonthe District in Southern Sierra Leone. Together the couple had five children.\u003C\/p\u003E\n\u003Cp\u003EKabbah received his higher education at the Cardiff College of Food Technology and Commerce and University College Aberystwyth, Wales, in the United Kingdom, gaining a Bachelor\u0027s degree in Economics in 1959. He later studied law, and in 1969 he became a practicing Barrister-at-Law and a member of the Honourable Society of Gray\u0027s Inn, London.\u003C\/p\u003E\n\u003Ch5\u003ECareer\u003C\/h5\u003E\n\u003Cp\u003EKabbah spent nearly his entire career in the public sector. He served in the Western Area and in all the Provinces of Sierra Leone. He was a District Commissioner in Bombali and Kambia (Northern Province), in Kono (Eastern Province) and in Moyamba and Bo (Southern Province). He later became Permanent Secretary in various Ministries, including Trade and Industry, Social Welfare, and Education.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EUnited Nations\u003C\/strong\u003E\u003Cbr \/\u003EKabbah was an international civil servant for almost two decades. After serving as deputy Chief of the West Africa Division of the UN Development Programme (UNDP) in New York City, he was reassigned in 1973 to head the Programme\u0027s operation in the Kingdom of Lesotho, as Resident Representative. He also headed UNDP operations in Tanzania and Uganda, and just before Zimbabwe\u0027s independence, he was temporarily assigned to that country to help lay the groundwork for cooperation with the United Nations system.\u003C\/p\u003E\n\u003Cp\u003EAfter a successful tour of duty in Eastern and Southern Africa, Kabbah returned to New York to head UNDP\u0027s Eastern and Southern Africa Division. Among other things, he was directly responsible for coordinating UN system assistance to liberation movements recognized by the Organization of African Unity (OAU), such as the African National Congress (ANC) of South Africa, and the South West African People\u0027s Organization (SWAPO) of Namibia.\u003C\/p\u003E\n\u003Cp\u003EBefore his retirement in 1992, Kabbah held a number of senior administrative positions at UNDP Headquarters in New York, including those of deputy director and Director of Personnel, and Director, Division of Administration and Management.\u003C\/p\u003E\n\u003Ch5\u003EPolitical career in Sierra Leone\u003C\/h5\u003E\n\u003Cp\u003EAfter the military coup in 1992, he was asked to chair the National Advisory Council, one of the mechanisms set up by the military to facilitate the restoration of constitutional rule, including the drafting of a new constitution for Sierra Leone. He reputedly intended his return to Sierra Leone to be a retirement, but was encouraged by those around him and the political situation that arose to become more actively involved in the politics of Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EFirst term as president\u003C\/strong\u003E\u003Cbr \/\u003EKabbah was seen as a compromise candidate when he was put forward by the Mende-dominated Sierra Leone People\u0027s Party (SLPP) as their presidential hopeful in the 1996 Presidential and Parliamentary elections, the first multi-party elections in twenty-three years. The SLPP won the legislative vote overwhelmingly in the South and Eastern Province of the country, they split the vote with the UNPP in the Western Area and they lost in the Northern Province.\u003C\/p\u003E\n\u003Cp\u003EOn March 29, 1996, Alhaji Ahmad Tejan Kabbah was sworn in as Sierra Leone\u0027s first freely elected president. Guided by his philosophy of \u0022political inclusion\u0022, he appointed the most broad-based government in the nation\u0027s history, drawing from all political parties represented in Parliament, and ‘technocrats’ in civil society. One minority party did not accept his offer of a cabinet post.\u003C\/p\u003E\n\u003Cp\u003EThe President\u0027s first major objective was to end the rebel war which, in four years had already claimed hundreds of innocent lives, driven thousands of others into refugee status, and ruined the nation\u0027s economy. In November 1996, in Abidjan in Côte d\u0027Ivoire, he signed a peace agreement with the rebel leader, former Corporal Foday Sankoh of the Revolutionary United Front (RUF).\u003C\/p\u003E\n\u003Cp\u003EThe rebels reneged on the Agreement, resumed hostilities, and later perpetrated on the people of Sierra Leone what has been described as one of the most brutal internal conflicts in the world.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003ECoup and exile\u003C\/strong\u003E\u003Cbr \/\u003EIn 1996, a coup attempt involving Johnny Paul Koroma and other junior officers of the Sierra Leone Army was unsuccessful, but served as notice that Kabbah\u0027s control over military and government officials in Freetown was weakening.\u003C\/p\u003E\n\u003Cp\u003EIn May 1997, a military coup forced Kabbah into exile in neighbouring Guinea. The coup was led by the Armed Forces Revolutionary Council, and Koroma was freed and installed as the head of state. In his Guinea exile, Kabbah began to marshal international support. Just nine months after the coup, Kabbah\u0027s government was revived as the military-rebel junta was removed by troops of the Economic Community of West African States (ECOWAS) under the command of the Nigerian led ECOMOG (ECOWAS Ceasefire Monitoring Group) and loyal civil and military defence forces, notably the Kamajors led by Samuel Hinga Norman.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EReturn to Sierra Leone\u003C\/strong\u003E\u003Cbr \/\u003EOnce again, in pursuit of peace, President Kabbah signed the Lomé Peace Accord with the RUF rebel leader Foday Sankoh on 7 July 1999. Notwithstanding repeated violations by the RUF, the document, known as the Lomé Peace Agreement, remained the cornerstone of sustainable peace, security, justice and national reconciliation in Sierra Leone. On 18 January 2002, at a ceremony marking the conclusion of the disarmament and demobilization of ex-combatants under the auspices of the United Nations Mission in Sierra Leone (UNAMSIL), he declared that the rebel war was over.\u003C\/p\u003E\n\u003Ch5\u003ESaved by Nigeria and Britain\u003C\/h5\u003E\n\u003Cp\u003EAlthough elected as president, he faced the task of fighting a brutal enemy. His most crucial military support was however from outside; Nigeria was the foremost participant as they crucially intervened under the leadership of General Sani Abacha, who was then the military head of his country. In February 1998, he sent his troops to push out the infamous military junta and rebel alliance of Johnny Paul Koroma and Sam Bockarie, known as Maskita. The rebels however continued their attempt to overthrow Kabbah\u0027s government, despite signing numerous peace accords with President Kabbah. In May 2000, Foday Saybanah Sankoh, who was then part of Kabbah\u0027s cabinet, kidnapped several UN troops, and then ordered his rebels to march to Freetown. Trouble was looming as the capital was once more threatened with another January 6, 1999, scenario. But with the timely intervention of the British Prime Minister, Tony Blair, 800 British troops were sent to Freetown to halt the impending rebel march to the city. President Kabbahe was very grateful to the British Prime Minister, calling his intervention \u0022timely\u0022 and one that \u0022Sierra Leonean people will never forget\u0022.\u003C\/p\u003E\n\u003Ch5\u003EEnding of the Civil War\u003C\/h5\u003E\n\u003Cp\u003EAs president, Kabbah opened direct negotiations with the RUF rebels in order to end the civil war. He signed several peace accords with the rebel leader Foday Sankoh, including the 1999 Lomé Peace Accord, in which the rebels, for the first time agreed to a temporary cease fire with the Sierra Leone government. When the cease fire agreement with the rebels collapsed, Kabbah campaigned for international assistant from the British, the United Nations Security Council, the African Union and the Economic Community of West African States to help defeat the rebels and restore peace and order in Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EIn October 1999, the United Nations agreed to send peacekeepers to help restore order and disarm the rebels. The first of the 6,000-member force began arriving in December, and the UN Security Council voted in February 2000 to increase the force to 11,000, and later to 13,000. The UN peacekeeping forces were made up mainly of soldiers from the British special forces, India, Bangladesh and Pakistan. The African Union special forces sent to Sierra Leone to assist the government in fighting the rebels were made up mainly of soldiers from Nigeria, Guinea, Ghana, Kenya, Mali, Zambia and The Gambia. The international forces, led by the British troops, launched a number of successful military operations to repel the RUF rebels and retake many of the areas of the country that were under the rebel control. The rebel lines of communication were severely disrupted and many senior rebel leaders were captured or fled the country, including the RUF leader Foday Sankoh, who was captured.\u003C\/p\u003E\n\u003Cp\u003EThe rebels finally agreed to be disarmed; in return the Sierra Leone government, led by Kabbah, offered them amnesty and career opportunities and counselling. The child rebels were placed in public schools, also offered counselling and reunited with family members. In 2001, UN forces moved in rebel-held areas and began to disarm the rebels.\u003C\/p\u003E\n\u003Cp\u003EThe civil war was officially declared over in early 2002 by Kabbah. Tens of thousands of Sierra Leoneans across the country took to the streets to celebrate the end of the war. Kabbah went on to easily win his final five years term in office in the presidential election later that year with 70.1% of the vote, defeating his main opponent Ernest Bai Koroma of the main opposition All People\u0027s Congress (APC). International observers declared the election free and fair. After the contribution made by the Bangladesh UN Peacekeeping Force in the war, Kabbah declared Bengali an honorary official language in December 2002.\u003C\/p\u003E\n\u003Ch5\u003EEnd of term and post-presidency\u003C\/h5\u003E\n\u003Cp\u003EKabbah left office in September 2007 at the end of his second 5-year term. Constitutionally, he was ineligible to seek re-election. His Vice-president, Solomon Berewa, ran as the SLPP candidate to succeed Kabbah but was defeated by opposition candidate Ernest Bai Koroma of the APC.\u003C\/p\u003E\n\u003Cp\u003EKabbah was the head of the Commonwealth\u0027s observer mission for the December 2007 Kenyan election, as well as the head of the African Union\u0027s observer mission for the March 2008 Zimbabwean election which he condemned as being \u0022rife with fraud and abuse\u0022 and \u0022plagued by outrageous violence.\u0022\u003C\/p\u003E\n\u003Ch5\u003EDeath\u003C\/h5\u003E\n\u003Cp\u003EKabbah died at his home in Juba Hill, a middle class neighborhood in the west end of Freetown at the age of 82 on March 13, 2014, after a short illness. Following the announcement of Kabbah\u0027s death, Sierra Leone\u0027s President Ernest Bai Koroma declared a week of national mourning; and he ordered the country\u0027s flags to be flown at half mast throughout Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EA state funeral was held for Kabbah. The funeral service was attended by several former heads of state, international delegations, former and current government officials, regardless of their political parties, and members of the civil services.\u003C\/p\u003E\n\u003Cp\u003EOn March 21, 2014, Kabbah\u0027s coffin was carried by soldiers of the Sierra Leone Armed Forces into the Sierra Leone House of Parliament where members of parliament paid their last respects to the former head of state. On March 23, 2014, Kabbah\u0027s coffin was brought to the National Stadium, as thousands of Sierra Leoneans lined the streets of Freetown to say goodbye to their former leader. Kabbah\u0027s body was then carried by soldiers to the Mandingo Central Mosque in Freetown where an Islamic prayer service was held before he was laid to rest at the Kissi Road Cemetery, next to his mother Hajah Adama Kabbah\u0027s grave.\u003C\/p\u003E\n\u003Ch5\u003EPersonal life\u003C\/h5\u003E\n\u003Cp\u003EKabbah\u0027s wife Patricia, an ethnic Sherbro, died in 1998. He has five children: Mariama, Abu, Michael, and Tejan Jr., and six grandchildren: Simone, Aidan, Abubakarr Sidique, Mariama, Nkoya, and Zainab Kabbah. In 2008 he married Isata Jabbie Kabbah, who was about 40 years his junior.\u003C\/p\u003E\n\u003Ch5\u003EHonors\u003C\/h5\u003E\n\u003Cp\u003EPresident Kabbah, as chancellor of the University of Sierra Leone in Freetown holds an honorary doctor of laws degree of the university. In September 2001 Southern Connecticut State University in the United States awarded him with an honorary degree of Doctor of Laws, in recognition of his effort to bring peace to his country. In July 2006, he received another honorary degree of Doctor of Laws from the University of Bradford in the United Kingdom, for his contribution to restoring peace in his country after a decade of civil war, and for working towards political and economic reconstruction following the end of the war.\u003C\/p\u003E\n\u003Cp\u003EKabbah was a grand commander of the Order of the Republic of Sierra Leone.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/ahmad-tejan-kabbah.webp","CandidateSLEOP_UUID":"351d7c21-45eb-4f71-8658-c463673b75c4","CandidateFullname":"Ahmad Tejan Kabbah","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"91","FirstName":"Ernest","MiddleName":"Bai","SurName":"Koroma","PoliticalParty":"All Peoples Congress (APC)","ElectionYear":"2012-11-17, 2007-08-11, 2002-05-14","ElectionType":"Presidential","Profile":"\u003Cp\u003EErnest Bai Koroma is the current President of Sierra Leone. He was elected in 2007 and re-elected in 2012. He is a member of the All People\u0027s Congress (APC) political party. He has a background in insurance and banking, and has served in various public sector roles. He has implemented a number of reforms to improve the economy and reduce corruption, and has been praised for his efforts to promote peace and stability in the country.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/Ernest-Bai-Koroma.jpg","CandidateSLEOP_UUID":"cda5ea29-d656-48ce-bfe3-33a27c058e4e","CandidateFullname":"Ernest Bai Koroma","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"4738","FirstName":"Nabieu","MiddleName":"Musa","SurName":"Kamara","PoliticalParty":"Peace and Liberation Party (PLP)","ElectionYear":"2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-05\/nabieu-osman-kamara-plp.jpg","CandidateSLEOP_UUID":"fc24f6b1-cc6b-4eab-bf64-91efca657c51","CandidateFullname":"Nabieu Musa Kamara","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"49","FirstName":"John","MiddleName":"","SurName":"Karefa-Smart","PoliticalParty":"United National People\u0026#039;s Party (UNPP)","ElectionYear":"2002-05-14, 1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EDr. John Albert Musselman Karefa-Smart (17 June 1915 – 26 August 2010) was a Sierra Leonean politician, medical doctor and university professor. He served as the first Foreign Minister under Sierra Leone\u0027s first Prime Minister, Sir Milton Margai. He was an ordained Elder of the United Methodist Church.\u003C\/p\u003E\n\u003Cp\u003EA medical doctor by profession, Karefa-Smart was one of the founding fathers of the Sierra Leone People\u0027s Party (SLPP) in 1951. He was one of Sir Milton Margai\u0027s closest political advisors and a close personal friend. From 1957 to 1964, Karefa-Smart was a Member of Parliament of Sierra Leone from Tonkolili District.\u003C\/p\u003E\n\u003Cp\u003EAfter the death of Prime Minister Milton Margai in 1964, Karefa-Smart challenged Albert Margai for the SLPP leadership position, but he was unsuccessful, as Albert won the SLPP leadership and succeeded his brother as Sierra Leone\u0027s Prime Minister. Karefa-Smart ultimately left the SLPP and politics overall and moved abroad to continue his professional career.\u003C\/p\u003E\n\u003Cp\u003EFrom 1965 to 1970, Karefa-Smart served as Assistant Director-General to the World Health Organization (WHO). In 1970, he made an unsuccessful bid for the Presidency in Sierra Leone. From there, he returned to Geneva, then migrated to the USA to pursue his career in university teaching, research and public speaking.\u003C\/p\u003E\n\u003Cp\u003EIn 1996, Karefa-Smart returned to Sierra Leone\u0027s politics as the founder of the newly formed United National People\u0027s Party (UNPP). He stood as the UNPP candidate in the 1996 presidential election, but he was defeated in the second round election runoff by the SLPP candidate Ahmad Tejan Kabbah.\u003C\/p\u003E\n\u003Ch5\u003EEducation\u003C\/h5\u003E\n\u003Cp\u003EAn ethnic Sherbro, Karefa-Smart was educated at the EUB[citation needed]. Primary School, in Moyamba District and the Albert Academy in Freetown. He received his BA from Fourah Bay College in Freetown in 1936. Four years later in 1940, he received his BS from Otterbein College in Westerville, Ohio, United States in 1940. From Otterbein, he went to McGill University in Montreal, where he received his MD and CM in 1944 and Diploma in Tropical Medicine in 1945. Finally, in 1948, he received his MPH from Harvard University in Boston.\u003C\/p\u003E\n\u003Ch5\u003EAcademia\u003C\/h5\u003E\n\u003Cp\u003EKarefa-Smart was also a fellow or professor at many colleges and universities across the world, including Bunumbu Union Teachers Training College in Sierra Leone (1936–38), University of Ibadan in Nigeria (1949–52), and several American universities such as Xavier University of Louisiana (1953), Columbia University (1964–65), Harvard University (1971–81), Boston University (1972–77), Wellesley College (1974), and Howard University (1980–83).\u003C\/p\u003E\n\u003Ch5\u003EPolitical career\u003C\/h5\u003E\n\u003Cp\u003EKarefa-Smart\u0027s political career began with his election to Parliament in 1957. From 1957 to 1964, Karefa-Smart was a member of parliament for Tonkolili District. He also served as Minister of Lands, Mines, \u0026amp; Labor; Defense; and as Minister of Foreign Affairs (1961–1964). During that time period, he also served occasionally as acting Prime Minister. From 1965 until 1970, he was Assistant Director-General of the World Health Organization in Geneva, Switzerland. In 1996, he returned to Sierra Leonean politics as a member of parliament and presidential candidate. Karefa-Smart lost the 1996 and 2002 presidential elections to Ahmad Tejan Kabbah.\u003C\/p\u003E\n\u003Ch5\u003EStatus as leader of the UNPP\u003C\/h5\u003E\n\u003Cp\u003EIt was initially reported on 12 June 2006 that Karefa-Smart had been replaced as leader of the UNPP at a party convention; however, Karefa-Smart subsequently refuted this claim and called the convention null and void.\u003C\/p\u003E\n\u003Ch5\u003EDeath\u003C\/h5\u003E\n\u003Cp\u003EKarefa-Smart was living in the US state of Connecticut when he was given a month to live and admitted to a hospice. In late July 2010, the Sierra Leonean government flew him back to Freetown, where he died on 26 August 2010.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/john-karefa-smart.jpg","CandidateSLEOP_UUID":"91b27537-979d-426c-ba8a-c3abc330b9f4","CandidateFullname":"John Karefa-Smart","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"92","FirstName":"Joshua","MiddleName":"Albert","SurName":"Carew","PoliticalParty":"Citizens Democratic Party (CDP)","ElectionYear":"2012-11-17","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/joshua-albert-carew.jpeg","CandidateSLEOP_UUID":"c282f65c-7bcd-443a-bfbb-2875072a1d79","CandidateFullname":"Joshua Albert Carew","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"4749","FirstName":"Abdulahi","MiddleName":"D.","SurName":"Saccoh","PoliticalParty":"Revolutionary United Front Party (RUFP)","ElectionYear":"2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-05\/abdulahi-d-saccoh-rufp.jpg","CandidateSLEOP_UUID":"ed7be0b6-9166-4c44-bfd3-a551062ea8b0","CandidateFullname":"Abdulahi D. Saccoh","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"77","FirstName":"Kandeh","MiddleName":"Kolleh","SurName":"Yumkella","PoliticalParty":" National Grand Coalition (NGC)","ElectionYear":"2018-03-07","ElectionType":"Presidential, Parliamentary","Profile":"\u003Cp\u003EAlhaji Dr. Kandeh Kolleh Yumkella (born July 5, 1959) is a Sierra Leonean Agricultural economist, politician, and the former United Nations Under-Secretary-General and the Special Representative of the Secretary-General for Sustainable Energy for All. He was also the chief executive officer of the Sustainable Energy for All Initiative. Yumkella is a former Chairman of UN-Energy and a two-term former Director-General of the United Nations Industrial Development Organization (UNIDO).\u003C\/p\u003E\n\u003Cp\u003EBorn in Kambia District in Northern Sierra leone, Yumkella has a B.Sc. from Njala University; a B.Sc. from the Cornell University; and a Ph.D. in Agricultural economics from the University of Illinois.\u003C\/p\u003E\n\u003Cp\u003EIn December 2005, Dr. Kandeh K. Yumkella was appointed Director-General of the United Nations Industrial Development Organization (UNIDO), having previously worked in various high-level policy positions in UNIDO. He was re-appointed for a second four-year term in office in December 2009.\u003C\/p\u003E\n\u003Cp\u003EPrior to working for UNIDO, Yumkella was the Minister for Trade, Industry of Sierra Leone from 1994-1995. From 1987-1996, he held various academic positions at Michigan State University and the University of Illinois in the United States. In recognition of his leadership and his passion for energy and environment-related causes, Yumkella was appointed as Chair of UN-Energy in 2008 by the UN Secretary-General.\u003C\/p\u003E\n\u003Cp\u003EYumkella is a prominent public speaker, who addresses global issues, including poverty reduction, climate change,[2] the Millennium Development Goals and green industry and renewable energy.[5] Dr. Yumkella\u0027s opinion pieces have appeared in major international newspapers, including The New York Times, the International Herald Tribune,[6] and The Guardian. He has also appeared on several international broadcast networks, including CNN\u0027s Amanpour programme, BBC, Sky News, Aljazeera and CNBC.\u003C\/p\u003E\n\u003Cp\u003EYumkella is a Muslim and a member of the Susu ethnic group. Yumkella is married to Philomena Yumkella\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/dr-kandeh-yumkella.jpg","CandidateSLEOP_UUID":"80f3c628-b2b6-4e9e-ab40-fbb3a5cd28e5","CandidateFullname":"Kandeh Kolleh Yumkella","ElectionDistrict":"Karene","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"Constituency 62","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"93","FirstName":"Eldred","MiddleName":"","SurName":"Collins","PoliticalParty":"Revolutionary United Front Party (RUFP)","ElectionYear":"2012-11-17","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/Eldred-Collins.jpg","CandidateSLEOP_UUID":"3a35f26f-698d-4f58-b386-43c30819ee97","CandidateFullname":"Eldred Collins","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"5466","FirstName":"Mohamed","MiddleName":"","SurName":"Jonjo","PoliticalParty":"Citizens Democratic Party (CDP)","ElectionYear":"2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-05\/mohamed-jonjo-cdp.jpg","CandidateSLEOP_UUID":"5815cde8-37f1-4fad-bafb-f245a53721bb","CandidateFullname":"Mohamed Jonjo","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"32","FirstName":"Julius","MiddleName":"Maada Wonie","SurName":"Bio","PoliticalParty":"Sierra Leone Peoples Party (SLPP)","ElectionYear":"2023-06-24, 2018-03-07, 2012-11-17","ElectionType":"Presidential","Profile":"\u003Cp\u003EJulius Maada Wonie Bio is a Sierra Leonean politician who was the Head of State of Sierra Leone from January 16, 1996 to March 29, 1996. He is best remembered for initiating the peace process that brought back peace to a bitterly divided country, returning Sierra Leone to democracy and handing power to a democratically elected government.\u003C\/p\u003E\n\u003Cp\u003EHe is also currently an active member of the Sierra Leone People\u0027s Party (SLPP) and was its presidential candidate in the 2012 presidential election.\u003C\/p\u003E\n\u003Cp\u003EBorn on May 12, 1964 in Tihun, a village in the Sogbini Chiefdom, Bonthe District, in the Southern Province of Sierra Leone, Maada is one of 35 children born to a Mende Paramount Chief, Charlie Bio II, of Sogbini Chiefdom.\u003C\/p\u003E\n\u003Cp\u003EMaada began his primary education at the Roman Catholic Primary School in Tihun. After finishing his early years in primary school, he was sent to the town of Pujehun where he completed his primary education at the Holy Family Primary School. He then enrolled at the Government Secondary School in Bo (commonly known as The Bo School) where he spent seven years. He graduated from Bo School in 1984.\u003C\/p\u003E\n\u003Cp\u003EAfter graduating from secondary school Maada enrolled in the Sierra Leone Armed forces military academy. He graduated from the Military academy as a Second Lieutenant in October 1987 at the age of 22. In 1990, he was deployed by the Sierra Leone Government as a member of the ECOMOG peacekeeping force to battle the rebels of the Liberian Civil War that were fighting to overthrow the Liberian Government. At the time, thousands of Liberians were fleeing to Sierra Leone weekly, exposing the country’s fragile security and adding to the economic hardship.\u003C\/p\u003E\n\u003Cp\u003EAfter a year in Liberia as an ECOMOG soldier, the Sierra Leone Government ordered Maada to immediately return to Sierra Leone and become a member of a 600 battalion of soldiers set up to squash a rebellion by rebels known as the Revolutionary United Front (RUF).\u003C\/p\u003E\n\u003Cp\u003EMaada officially became a member of the Sierra Leone People\u0027s Party (SLPP) in 2005. That same year, Bio sought the leadership of the Sierra Leone People\u0027s Party (SLPP) at its national convention in Makeni in September 2005, where he came third. On 31 July 2011, he won the election to become the SLPP\u0027s 2012 presidential candidate at the SLPP convention in Freetown. He faced off with President Ernest Bai Koroma of the ruling APC and was defeated, winning 37% of the vote, but established the SLPP as the only viable opposition party in Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003ESince the 2012 election, Bio has continued to work closely with his colleagues in the SLPP to provide a vocal and effective oppostiion in Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EIn 2014 Bio launched the Maada and Fatima Bio Foundation. The objectives of this new charitable organization providing educational subsidies for disadvantaged children, skills training and enterprise development programs for deprived women and youths, assisting with the provision of basic healthcare services in needy communities and supporting rural community agricultural development programs.\u003C\/p\u003E\n\u003Cp\u003EBio also remains a respected commentator on international affairs, with published articles in The Guardian and Huffington Post. Bio has also spoken on the key challenges facing Sierra Leone at the Royal Institute of International Affairs, Chatham House.\u003C\/p\u003E\n\u003Cp\u003EMaada is a graduate of American University in Washington, D.C. with a Masters Degree in International Affairs. He served as the President of International Systems Science Corporation (ISSC), a consulting and investment management firm based in the United States. He is also married with four children.​\u003C\/p\u003E\n\u003Cp\u003ECurrently a Senior  Research Fellow at the prestigious University of Bradford in UK pursuing a PhD in Peace Studies\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/julius-maada-bio.jpg","CandidateSLEOP_UUID":"c6a97d3a-10b4-4d4c-a0b7-7acb5fc4397d","CandidateFullname":"Julius Maada Wonie Bio","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"78","FirstName":"Mohamed","MiddleName":"Kamarainba","SurName":"Mansaray","PoliticalParty":"Alliance Democratic Party (ADP)","ElectionYear":"2018-03-07","ElectionType":"Presidential","Profile":"\u003Cdiv\u003E\n\u003Cp\u003EMohamed Mansaray widely known as Kamarainba, is a Sierra Leonean politician, psychologist, and the current leader and chairman of the Alliance Democratic Party (ADP), a left-wing populist political party he formed in Sierra Leone in opposition to the country\u0022s two main political parties, the ruling APC party and the main opposition SLPP.\u003C\/p\u003E\n\u003Cp\u003EKamarainba is a left-wing populist politician, who says he represents the poor Sierra Leoneans who have been neglected by the government for too long. He is an outspoken critic of Sierra Leone\u0027s political elites, especially Sierra Leone\u0022s president Ernest Bai Koroma and his ruling APC party\u003C\/p\u003E\n\u003Cp\u003EKamarainba was born in Port Loko in the north of Sierra Leone but he was raised in Koidu Town in eastern Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EKamarainba was previously a prominent member of the APC party United States branch, before he fell out with the most senior members of the APC in Sierra Leone in 22014. He ultimately left the APC and formed his own political party called the Alliance Democratic Party (ADP) in 2015.\u003C\/p\u003E\n\u003Cp\u003EMansaray ran for Parliament in 2015 as a member of the ADP party in constituency 030 in Bombali District, but he lost a close race to the APC candidate Ibrahim Ben Kargbo, a close ally of president Koroma.\u003C\/p\u003E\n\u003Cp\u003EMansaray has a Bachelor of Science in Sociology from Howard University and a Master\u0027s degree in Psychology from Chicago School of Professional Psychology.\u003C\/p\u003E\n\u003Cp\u003EMansaray is a Muslim and a native of Port Loko District in the north of Sierra Leone. He is married with three children.\u003C\/p\u003E\n\u003C\/div\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/mohamed-kamaraimba-mansaray.jpg","CandidateSLEOP_UUID":"9234ea5a-9a3b-4f19-bfdb-d4958d49ec32","CandidateFullname":"Mohamed Kamarainba Mansaray","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"94","FirstName":"Gibrilla","MiddleName":"","SurName":"Kamara","PoliticalParty":"People\u0026#039;s Democratic Party (PDP)","ElectionYear":"2012-11-17","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"10252505-b9fb-404c-a771-0e9f09e989c5","CandidateFullname":"Gibrilla Kamara","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"6222","FirstName":"Iye","MiddleName":"","SurName":"Kakay","PoliticalParty":"Alliance Democratic Party (ADP)","ElectionYear":"2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-05\/iye-kakay-adp.jpg","CandidateSLEOP_UUID":"cd5ae8b2-bc15-4652-9633-4a5d6da1d1dd","CandidateFullname":"Iye Kakay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Female","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"33","FirstName":"Samura","MiddleName":"Mathew Wilson","SurName":"Kamara","PoliticalParty":"All Peoples Congress (APC)","ElectionYear":"2023-06-24, 2018-03-07","ElectionType":"Presidential","Profile":"\u003Cp\u003EDr. Samura Mathew Wilson Kamara is a Sierra Leonean politician, diplomat, and economist. He was the Minister of Foreign Affairs and International Cooperation of Sierra Leone from 2007 to 2018. He has also served as the Minister of Finance and Economic Development from 2002 to 2007. He is a former United Nations official and has held several senior positions in the United Nations system, including Resident Coordinator and Resident Representative of the United Nations Development Programme (UNDP) in Sierra Leone, and Director of the United Nations Population Fund (UNFPA) in the Democratic Republic of Congo. He is a member of the ruling All People\u0027s Congress (APC) and was the party\u0027s presidential candidate in the 2018 Sierra Leonean general election.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/dr-samura-matthew-wilson-kamara.jpg","CandidateSLEOP_UUID":"8db3e207-7f16-4c2e-a783-94b8136fead7","CandidateFullname":"Samura Mathew Wilson Kamara","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"PhD in Development Economics (1986) from Bangor University in Wales, United Kingdom., Masters’ Degree (1980) and PhD (1986) from the University College of North Wales, BANGOR., A bachelor of Science degree in Economics from Fourah Bay College, University of Sierra Leone (1972).","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":"\u003Ca href=\u0022https:\/\/samurakamara.com\/\u0022\u003Ehttps:\/\/samurakamara.com\/link\u003C\/a\u003E"},{"CandidateSLEOP_ID":"79","FirstName":"Gbandi","MiddleName":"Jemba","SurName":"Ngobeh","PoliticalParty":"Revolutionary United Front Party (RUFP)","ElectionYear":"2018-03-07","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/gbandi-jemba-ngobeh.jpg","CandidateSLEOP_UUID":"3a85a1bd-e8f1-49c8-aaad-db967b8c4c23","CandidateFullname":"Gbandi Jemba Ngobeh","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Female","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"95","FirstName":"Mohamed","MiddleName":"","SurName":"Bangura","PoliticalParty":"United Democratic Movement (UDM)","ElectionYear":"2012-11-17","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/Mohamed-Bangura.jpg","CandidateSLEOP_UUID":"6d61915f-39c2-44e2-a860-a4cab8f96fdf","CandidateFullname":"Mohamed Bangura","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"34","FirstName":"Edward","MiddleName":"Mohamed","SurName":"Turay","PoliticalParty":"All Peoples Congress (APC)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EEdward Mohamed Turay\u003C\/strong\u003E is a Sierra Leonean politician and diplomat. He was leader of the opposition All People\u0027s Congress (APC) from 1996 to 2002. He has been Sierra Leone\u0027s High Commissioner to the United Kingdom since 2010.\u003C\/p\u003E\n\u003Ch3\u003EBackground\u003C\/h3\u003E\n\u003Cp\u003E\u003Cstrong\u003EEducation and early years\u003C\/strong\u003E\u003Cbr \/\u003ETuray is from the Temne tribe of northern Sierra Leone and is from Makeni. He is a barrister by profession,having studied law at Manchester University, and been called to the bar at Lincoln\u0027s Inn in 1976. Returning to Sierra Leone in 1979, he was a magistrate for three years before engaging in politics in 1982. He is the founder and consultant of Eddie Turay \u0026amp; Associates, a leading law firm in Freetown, Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EPolitical career\u003C\/strong\u003E\u003Cbr \/\u003EIn 1986 Turay won a seat as a Member of Parliament for Bombali Central one Constituency. He was re-elected to parliament from Bombali District\u0027s Constituency 33 in the August 2007 parliamentary election, receiving 73.2% of the vote.\u003C\/p\u003E\n\u003Cp\u003EHe was leader of the All People\u0027s Congress (APC) from 1996 until 2002. He contested the 1996 national election for president, but lost the election after gaining just 5.1% of the first round of voting, good enough for fifth place. He was then Minority Leader of the House of Parliament from 1996 to 2002. Ernest Bai Koroma since took over as parliamentary leader and presidential candidate of the APC, beginning in 2002. On September 25, 2007, when the members of parliament were sworn in, Turay was appointed as leader of the Majority Party, in which position he was also Leader of Government Business.\u003C\/p\u003E\n\u003Cp\u003EIn January 2010, Turay was appointed Sierra Leone\u0027s High Commissioner to the United Kingdom of Great Britain and Northern Ireland, accredited to eight other states: Cyprus, Ireland, Spain, Portugal, Norway, Denmark, Sweden and Greece.\u003C\/p\u003E\n\u003Cp\u003EIn May 2014, Turay was awarded the Grassroot Diplomat Initiative Award under the Business Driver category for his extensive work on galvanising diaspora communities across Europe, bringing better visibility to his country and people.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EWriting\u003C\/strong\u003E\u003Cbr \/\u003ETuray is the author of an autobiographical book entitled The Prophecies of a Father (AuthorHouse, 2013), which \u0022revolves around the traditional beliefs and faith of his late father, Paramount Chief Kande Turay of Sanda Chiefdom. Turay’s father comes to represent a benevolence and acceptance of integrating Western beliefs and education with traditional African beliefs.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/edward-turay.jpeg","CandidateSLEOP_UUID":"d1e63ab9-f6cf-4446-84dd-7c281be790f9","CandidateFullname":"Edward Mohamed Turay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"80","FirstName":"Musa","MiddleName":"","SurName":"Tarawally","PoliticalParty":"Citizens Democratic Party (CDP)","ElectionYear":"2018-03-07","ElectionType":"Presidential","Profile":"\u003Cp\u003EMusa Tarawally, 51, can best be described as a politician\/businessman. He has served in both the ruling APC and the main opposition SLPP in different capacities. He is, however, contesting on the ticket of the Citizens Democratic Party (CDP).\u003C\/p\u003E\n\u003Cp\u003EHe was duly nominated after a party congress in January this year. He is a one-time youth leader of the SLPP and served as a minister under the APC government. He held positions of Minister of Internal Affairs and Minister of Lands at a point.\u003C\/p\u003E\n\u003Cp\u003EHe is on record to have stated that his love for politics started in his teens adding that he was running for the presidency because of his love for Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EHe was sacked as Minister of Lands by President Koroma in 2015 over shady deals under his tenure. Bangura Paul Alimamy will be standing as vice president for the CDP.\u003C\/p\u003E\n\u003Cp\u003EThe authorities detained him in December 2016 over the issue, a move he described as politically motivated given that it coincided with his declaration to run for president\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/musa-tarawally.jpg","CandidateSLEOP_UUID":"4508f9b7-9aa8-4e52-a52a-db72ce93dc9e","CandidateFullname":"Musa Tarawally","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"96","FirstName":"James","MiddleName":"Obai","SurName":"Fullah","PoliticalParty":"United National People\u0026#039;s Party (UNPP)","ElectionYear":"2012-11-17","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"efabb7cb-f802-463d-88e7-61ad2aa1f282","CandidateFullname":"James Obai Fullah","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"35","FirstName":"Abu","MiddleName":"Aiah","SurName":"Koroma","PoliticalParty":"Democratic Centre Party (DCP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EAbu Aiah Koroma (26 November 1928 – 6 March 2005) was a lawyer and politician in Sierra Leone. Koroma began his political career as Attorney General in 1967 and 1968. He returned to government in 1976 when he became Managing Director of the National Diamond Mining Company until 1987. In 1991 and 1992, Koroma was the Minister of Mineral Resources. In 1996, he ran as the presidential candidate of the Democratic Centre Party and gained just 4.9% of the national vote in the initial round of voting. After Ahmed Tejan Kabbah won the presidency, Koroma was named Minister of Political and Parliamentary Affairs, which lasted until Kabbah\u0027s re-election in 2002. Koroma died in 2005, at the age of 76.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"7a8e1aa2-30a6-436f-a004-f3673ba81bc8","CandidateFullname":"Abu Aiah Koroma","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"81","FirstName":"Mohamed","MiddleName":"C","SurName":"Bah","PoliticalParty":"National Democratic Alliance (NDA)","ElectionYear":"2023-06-24, 2018-03-07","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EMohamed C. Bah\u003C\/strong\u003E was born in Freetown and grew up in Koidu Town, Kono District, the Eastern part of Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EHe attended the UMC Boys primary school and the Ansarul Islamic Boys Secondary School before he moved back to Freetown.\u003C\/p\u003E\n\u003Cp\u003EMohamed C. Bah attended sixth form at Saint Edwards Secondary School before he immigrated to the United States of America.\u003C\/p\u003E\n\u003Cp\u003EHe attended the prestigious Strayer University and Arizona State University holding a post graduate degree in micro business leadership and  global human resource Finance.\u003C\/p\u003E\n\u003Cp\u003EMohamed C. Bah has written dozens of  widely published articles on Sierra Leone’s economy, debt elimination strategies and how to build a better economy in Sub Saharan Africa.\u003C\/p\u003E\n\u003Cp\u003EHe is an economist with a prudent vision on how to manage Fortune 500 business portfolios with the goal of amassing huge revenues and profit-making.\u003C\/p\u003E\n\u003Cp\u003EFrom 2002 to 2006, he was the founding President of  FPU- Georgia, USA, where his reputable organization supported the amputees and war wounded with millions of dollars worth of prosthetic limbs, medical supplies and used clothing.\u003C\/p\u003E\n\u003Cp\u003EHis organization also donated containers worth more than two million dollars during the height of the Ebola crisis in Sierra Leone.\u003C\/p\u003E\n\u003Cp\u003EIn 2007 - 2009, as the President of the Sierra Leonean Community in Atlanta, Georgia, he supported the Blind school in Freetown, with a brand New Kitchen and Chimney for the blind students.\u003C\/p\u003E\n\u003Cp\u003EHe also pioneered the effort with the city of Atlanta’s proclamation of April 27 as a public holiday for Sierra Leoneans living in Georgia.\u003C\/p\u003E\n\u003Cp\u003EIn 2015, he was elected as the Leader of the National Democratic Allaince and contested the 2018  Elections as the Presidential Candidate of the NDA party.\u003C\/p\u003E\n\u003Cp\u003EOn February 04, 2023, Mohamed C. Bah was endorsed by his party as the 2023 Presidential Candidate for the June 24, 2023 multi - tier elections.\u003C\/p\u003E\n\u003Cp\u003EMohamed C. Bah has worked in the United States for many Fortune 500 companies. He has managed  a 25 million dollar project on research and development for two bio medical companies and offered strategic planning in micro economic performances and revenue streamlining.\u003Cbr \/\u003E\u003Cbr \/\u003EMohamed C. Bah lives in Maryland with his wife and two sons. His hobbies are reading and fishing. He is currently working on writing his first book “Economic Freedom.”\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/mohamed-c-bah.jpg","CandidateSLEOP_UUID":"d9887f21-50b5-4b93-b532-ce61e2fc7797","CandidateFullname":"Mohamed C Bah ","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"mcbah4440@yahoo.com","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"318","FirstName":"Johnny","MiddleName":"Paul","SurName":"Koroma","PoliticalParty":"Peace and Liberation Party (PLP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"\u003Cp\u003EMajor Johnny Paul Koroma (9 May 1960 – 1 June 2003\/11 August 2017) was the head of state of Sierra Leone from May 1997 to February 1998.\u003C\/p\u003E\n\u003Ch5\u003EYouth and education\u003C\/h5\u003E\n\u003Cp\u003EKoroma was born to Limba parents in Tombodu, in the Kono District of eastern British Sierra Leone, and grew up in Freetown, the capital. He is from the same ethnic group as former presidents Siaka Stevens and Joseph Saidu Momoh.\u003C\/p\u003E\n\u003Cp\u003EHe joined the Sierra Leonean army in 1985 and was sent to the Royal Military Academy Sandhurst in England in 1988 to train as an officer. He returned to Sierra Leone the next year and was promoted to platoon commander, and soon thereafter to company commander. He continued to move up the ladder, and in 1994, he went to the Teshi Military College in Ghana for training in army command.\u003C\/p\u003E\n\u003Ch5\u003ECoups and civil war\u003C\/h5\u003E\n\u003Cp\u003EKoroma received military training in Nigeria and United Kingdom. He commanded government forces who were fighting against the Revolutionary United Front (RUF), a rebel army led by the warlord Foday Sankoh. In August 1996, he was arrested for alleged involvement in a coup plot against the southern civilian officials who were in control of the country. It was also alleged that there were plans to kill President Ahmad Tejan Kabbah.\u003C\/p\u003E\n\u003Cp\u003EKoroma was freed from prison during a successful military coup on 25 May 1997, when 17 junior soldiers serving the Sierra Leone Army (SLA) broke into the central prison and made a do-or-die offer that brought him to power.[clarification needed] He advocated making a peaceful settlement with Sankoh and allowing him to join the government, though this never happened.\u003C\/p\u003E\n\u003Cp\u003EAfter the coup in 1997, Koroma was named head of state and chairman of the Armed Forces Revolutionary Council (AFRC). He invited the leadership of the Revolutionary United Front to join the AFRC, which they promptly did. To maintain order, he suspended the constitution, banned demonstrations and abolished all political parties.\u003C\/p\u003E\n\u003Cp\u003EThe AFRC coup was accompanied by an explosion of violence against civilians throughout the nation. The key strategic change was that the RUF had immediate access throughout the country, something they had failed to achieve through six years of military action. Koroma cited corruption, erosion of state sovereignty, over-dependence on foreign nations, and leaders\u0027 failure to address tensions between the SLA and government-backed tribal militia movements (in particular the Kamajors) as the pretext for the coup.\u003C\/p\u003E\n\u003Cp\u003EKoroma\u0027s story was consistent with that of the AFRC, which cited the failure of the Abidjan Peace Accord struck between the government of Sierra Leone and the RUF on 30 November 1996.\u003C\/p\u003E\n\u003Ch5\u003EInvolvement of ECOMOG\u003C\/h5\u003E\n\u003Cp\u003EBy 2 June 1997, the RUF\/AFRC found itself at odds with Nigerian forces, which were deployed unilaterally under the Economic Community of West African States\u0027 Ceasefire Monitoring Group (ECOMOG) and its mandate of August 1997. The Nigerians were stationed in and around Freetown\u0027s Western Area, trading mortar fire along the main highway into Freetown and around Freetown International Airport.\u003C\/p\u003E\n\u003Cp\u003EKoroma immediately sought to ease the situation, seeking mediation, which resulted in the signing of a peace accord in late October 1997 in Conakry, Guinea. Almost immediately, violations of the peace accord were perpetrated by all sides in the complex conflict. By January 1998, ECOMOG forces were preparing to oust the RUF\/AFRC from power.\u003C\/p\u003E\n\u003Cp\u003EOn 6 February 1998, ECOMOG forces invaded key locations in the Western Area, removing the RUF\/AFRC entirely by 12 February. On 1 March, ECOMOG forces commenced operations in provincial Sierra Leone, removing the RUF\/AFRC from every key town except Kailahun (in the far east of the country). By December 1998, RUF\/AFRC forces had reversed this position, and they entered Freetown in January 1999. Failing to hold territory, the RUF\/AFRC retreated into the Northern Province of Sierra Leone.\u003C\/p\u003E\n\u003Ch5\u003ELomé Peace Agreement\u003C\/h5\u003E\n\u003Cp\u003EThe leadership of the RUF oversaw negotiations with the government of Sierra Leone that led to the signing of the Lomé Peace Accord on 7 July 1999. Koroma was cut out of the negotiations, and the AFRC did not benefit from the substantive provisions of the agreement. Nevertheless, Koroma participated in the disarmament process, encouraging those SLA soldiers who had joined the AFRC to demobilize.\u003C\/p\u003E\n\u003Cp\u003EBy 2000, Koroma no longer held significant influence over the RUF leadership, as evidenced by the involvement of ex-AFRC members (from a splinter group called the West Side Boys) in defending towns in Port Loko District against a renewed RUF offensive in May 2000. In August 2000, Koroma officially disbanded the AFRC and sought to consolidate his position by forming a political party.\u003C\/p\u003E\n\u003Ch5\u003ESpecial Court for Sierra Leone\u003C\/h5\u003E\n\u003Cp\u003EIn early 2002, the government of Sierra Leone and the United Nations signed a bilateral treaty establishing the Special Court for Sierra Leone, mandated to try those who \u0022bear the greatest responsibility\u0022 for crimes against humanity, war crimes, and other serious violations of international humanitarian law. According to the indictment, the RUF\/AFRC, under the orders of Koroma, had led armed attacks in Sierra Leone in which the primary targets included civilians, humanitarian aid workers, and UN peacekeeping forces.\u003C\/p\u003E\n\u003Cp\u003EThese attacks served the purpose of terrorizing the population as a form of punishment for not supporting rebel activities. They included such crimes as looting, murder, mutilations, sexual violence, and rape. Child soldiers were conscripted, and women and girls were kidnapped to be raped or turned into sex slaves. Men and boys were also abducted and forced to work or fight for the rebel groups.\u003C\/p\u003E\n\u003Cp\u003EOn 7 March 2003, the prosecutor of the Special Court issued his first indictments. For his role in the RUF\/AFRC, Koroma was among them. He fled Freetown in December, reportedly to Liberia. On 1 June 2003, he was officially declared dead under mysterious circumstances, said to have been murdered. However, the prosecutor has yet to withdraw the indictment against Koroma. An October 2006 newspaper headline in Freetown read, \u0022Johnny Paul has 1,000 armed soldiers\u0022.\u003C\/p\u003E\n\u003Cp\u003EAccording to an unconfirmed report in September 2008, Koroma\u0027s remains were found buried in Foya, a village in Liberia\u0027s Lofa County. However, Stephen Rapp, the Special Court\u0027s prosecutor, noted that DNA tests on the remains found in Lofa County did not match Koroma\u0027s DNA. As of 2010, many still believe Koroma was executed somewhere in Lofa at the hands of former President Charles Taylor of Liberia.\u003C\/p\u003E\n\u003Cp\u003EThree witnesses—former Vice President Moses Blah of Liberia; Joseph Zig Zag Marzah, a former member of Taylor’s National Patriotic Front of Liberia (NPFL) rebel group; and a protected witness—testified that while they had not witnessed Koroma\u0027s execution, Taylor had told them about it. In October 2010, Taylor\u0027s defense team filed a motion to have these testimonies removed as evidence, alleging that the prosecution had bribed the three witnesses, but this motion was rejected the following month.\u003C\/p\u003E\n\u003Cp\u003EApparently Koroma in the end only died on 10 or 11 August 2017 in his home village Binkolo.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/johnny-paul-koroma.jpg","CandidateSLEOP_UUID":"0a328bf4-b30d-44ca-9bc7-f4d14dfb7900","CandidateFullname":"Johnny Paul Koroma","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"36","FirstName":"Mohamed","MiddleName":"","SurName":"Sillah","PoliticalParty":"National Alliance Democratic Party (NADP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EMohamed Yahya Sillah\u003C\/strong\u003E (born December 12, 1949) is a Sierra Leonean politician, journalist and human rights activist. He was active in the transition efforts from military to civilian rule in Sierra Leone. As the National Chairman of the National Alliance Democratic Party (NADP), he was an unsuccessful candidate in the 1996 Presidential elections.\u003C\/p\u003E\n\u003Ch5\u003E\u003Cstrong\u003EEarly life\u003C\/strong\u003E\u003C\/h5\u003E\n\u003Cp\u003ESillah was born on December 12, 1949 in Massam Kpaka, Pujehun District, British Sierra Leone to Acting Paramount Chief Alhaji Yahya Sillah of Dama Chiefdom, Kenema District and Haja Mamie Zoe Mansaray.\u003C\/p\u003E\n\u003Ch5\u003E\u003Cstrong\u003ECareer\u003C\/strong\u003E\u003C\/h5\u003E\n\u003Cp\u003E\u003Cstrong\u003EJournalism\u003C\/strong\u003E\u003Cbr \/\u003EMohamed Yahya Sillah started his career in journalism in 1978 as Senior Reporter with the Liberian News Agency (LINA), Ministry of Information and Broadcasting in Monrovia, Liberia. He became Managing Editor of Third World News at the Atlanta Voice Newspaper, Atlanta, Georgia, USA in 1981. In 1983, he founded the African World News magazine in Atlanta, Georgia.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EFirst Liberian Civil War\u003C\/strong\u003E\u003Cbr \/\u003EIn 1990, Sillah traveled to Liberia to cover the First Liberian Civil War for African World News. He reported about rebels drinking human blood from freshly slaughtered civilians.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EHunger relief efforts\u003C\/strong\u003E\u003Cbr \/\u003EThousands of Sierra Leoneans were stranded in Liberia during the war. The Sierra Leone embassy in Monrovia closed and the Sierra Leone government under president Joseph Saidu Momoh (APC) declared its inability to rescue the stranded Sierra Leoneans. He worked with other concerned Sierra Leonean refugees to take charge at the embassy. Sillah negotiated with the rebels to sell bags of rice that he purchased and distributed for free to all refugees at the embassy.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EEvacuation\u003C\/strong\u003E\u003Cbr \/\u003EAs the assault on the embassy intensified, Sillah undertook to rescue those stranded in the embassy and convey them to safety at Monrovia\u0027s free port facility. He did so by paying combatant factions with his own money to facilitate passage through ambush points along the way. He succeeded evacuating all the refugees with the help of ECOMOG soldiers less than an hour before a rebel missile destroyed the embassy. At the Monrovia Freeport, Sillah formed the Sierra Leone Evacuation Organization.\u003C\/p\u003E\n\u003Cp\u003EHe aided in the successful evacuation of approximately 5000 people to Freetown over a period of 90 days via the Nigerian gunboat known as The Ambe, earning him the nickname \u0027Junior Moses\u0027.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003ENational Alliance Democratic Party\u003C\/strong\u003E\u003Cbr \/\u003EThe leadership ability Sillah demonstrated attracted the attention of American diplomats in Monrovia, Liberia. He entered politics in 1995 and became the Party Leader and National Chairman of the National Alliance Democratic Party (NADP). He also began his campaign for the Sierra Leone presidency the same year.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003E1996 presidential campaign\u003C\/strong\u003E\u003Cbr \/\u003ESillah ran as the NADP candidate in the 1996 Presidential elections. He received 0.5% of the votes (3,723 total votes). He contested the election results on BBC\u0027s Focus on Africa.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EActivism against deportation of Sierra Leoneans in the US\u003C\/strong\u003E\u003Cbr \/\u003EIn 2004, Sillah opposed the deportation of Sierra Leoneans from the United States after the US withdrew their protective privilege known as Temporary protected status (TPS). He made an appeal to the US government on their behalf.\u003C\/p\u003E\n\u003Cp\u003ESillah won the support of Georgia Congressman John Lewis, who sent a request to the Secretary of Homeland Security urging them to reconsider the TPS issue, which led to a reprieve for the refugees.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003ESupport for Paul Kamara\u003C\/strong\u003E\u003Cbr \/\u003EIn 2004, as NADP leader Sillah protested the imprisonment of Sierra Leonean journalist, Paul Kamara, editor of For Di People Newspaper. Sillah viewed Kamara\u0027s imprisonment and the subsequent banning of his newspaper as a breach of the SLPP government’s commitment to freedom of the press and the constitutional exercise of free speech.\u003C\/p\u003E\n\u003Cp\u003EHe criticized President Ahmad Tejan Kabbah for allowing the imprisonment of Kamara and held that the exercise of democracy and the protection of human rights were fundamental to people\u0027s right to free speech.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003E2007 Presidential and Parliamentary elections\u003C\/strong\u003E\u003Cbr \/\u003EIn 2007 Sillah withdrew his bid for national leadership in the Presidential and Parliamentary elections, citing inadequate funding and ineffective campaign management. He supported the Sierra Leone People\u0027s Party (SLPP) presidential candidate, Vice President Solomon Berewa, who lost the election.\u003C\/p\u003E\n\u003Cp\u003ESillah congratulated the winning candidate, Ernest Bai Koroma of the All People\u0027s Congress (APC) party. He vowed to respect any Sierra Leonean who was legitimately and democratically elected to office.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"d94298d0-94a3-49e3-bca1-8eccb432b94f","CandidateFullname":"Mohamed Sillah","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"82","FirstName":"Mohamed","MiddleName":"","SurName":"Sowa-Turay","PoliticalParty":"United Democratic Movement (UDM)","ElectionYear":"2018-03-07, 2023-06-24","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/mohamed-turay-sowa.png","CandidateSLEOP_UUID":"64c012ca-e6f3-4f66-aab2-49d8ff1c8181","CandidateFullname":"Mohamed Sowa-Turay ","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"319","FirstName":"Alimamy","MiddleName":"Pallo","SurName":"Bangura","PoliticalParty":"Revolutionary United Front Party (RUFP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EAlimamy Pallo Bangura\u003C\/strong\u003E is a politician in Sierra Leone. Over the past 12 years, Bangura has played a major role in Sierra Leonean politics and was a member of the Revolutionary United Front Party, where he replaced rebel leader Foday Sankoh following Sankoh\u0027s May 2000 arrest and 2002 electoral disqualification. His posts have included: Ambassador to the United Nations from Sierra Leone (1994–1996); Foreign Minister (1997–1998); Minister of Energy and Power (1999–2001); and Secretary General of the Revolutionary United Front Party (2002–2007). He also ran for president in 2002 alongside former cabinet minister Peter Vandy, but the pair only received 1.7% of the presidential vote, while the RUF received only 2.2% of the parliamentary vote.\u003C\/p\u003E\n\u003Ch5\u003EEducation\u003C\/h5\u003E\n\u003Cp\u003EBangura holds a master\u0027s degree from the School of Oriental and African Studies, University of London.\u003C\/p\u003E\n\u003Ch5\u003EPolitical beliefs\u003C\/h5\u003E\n\u003Cp\u003EThe RUF was made famous for its brutal war tactics that included kidnapping and torture. However, Bangura sought to change the face of the party. He describes himself as a supporter of democracy and a Christian. He has said \u0022I\u0027m not one who looks down on anybody. I do not reject anybody. I do not condemn anybody. The kind of Christian that I am is to accept everybody as God\u0027s child, and God having a purpose for each one. That is how I see it.\u0022\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"881629bf-f8b2-4a83-877a-0ab7540d3d49","CandidateFullname":"Alimamy Pallo Bangura","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"37","FirstName":"Amadu","MiddleName":"","SurName":"Jalloh","PoliticalParty":"National Democratic Alliance (NDA)","ElectionYear":"2007-08-11, 1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EAlhaji Amadu Jalloh is a politician in Sierra Leone. He contested the 1996 presidential election as a member of the National Democratic Alliance, where he finished in 8th place with 2.3% of the first round voting. He ran again as the NDA candidate in the August 2007 presidential election, receiving 0.96% of the vote and fifth place.\u003C\/p\u003E\n\u003Cp\u003EOn August 27, 2007, Jalloh announced his party\u0027s support for second place candidate Solomon Berewa of the ruling Sierra Leone People\u0027s Party (SLPP) in the second round of the election. He denounced claims that he had allied with the opposition All People\u0027s Congress (APC) based on a photograph of himself with APC leader Ernest Bai Koroma and People\u0027s Movement for Democratic Change (PMDC) leader Charles Margai, which he said was taken after a consultative meeting between the parties.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"997457ca-4465-406b-b5f2-d415741edcb1","CandidateFullname":"Amadu Jalloh","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"83","FirstName":"Patrick","MiddleName":"John","SurName":"O\u0026#039;Dwyer","PoliticalParty":"National Progressive Democrats (NPD)","ElectionYear":"2018-03-07","ElectionType":"Presidential, Parliamentary","Profile":"","CandidatePhoto":"\/sites\/default\/files\/2023-04\/patrick-odwyer.jpg","CandidateSLEOP_UUID":"b2975a3f-172d-4a8c-81e9-22aa18aa66da","CandidateFullname":"Patrick John O\u0026#039;Dwyer","ElectionDistrict":"Western Area Urban","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"Constituency 132","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"320","FirstName":"Raymond","MiddleName":"","SurName":"Kamara","PoliticalParty":"Grand Alliance Party (GAP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"976c1e2a-1275-4630-899d-75e6b32cf089","CandidateFullname":"Raymond Kamara","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"38","FirstName":"Andrew","MiddleName":"","SurName":"Turay","PoliticalParty":"National People\u0026#039;s Party (NPP)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EAndrew Turay is a Sierra Leonean politician. He competed in the 1996 presidential election as part of the National People\u0027s Party (NPP). He received 0.5% of the vote (3,925 total votes).\u003C\/p\u003E\n\u003Cp\u003ETuray was the candidate for the Convention People\u0027s Party in the August 2007 presidential election. He received fourth place and 1.56% of the vote. In early September, prior to the second round of the election, he announced his support for Solomon Berewa of the Sierra Leone People\u0027s Party (SLPP).\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"f8a85dcc-cbbd-4cc0-a99d-5a7cde96222e","CandidateFullname":"Andrew Turay","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"84","FirstName":"Samuel","MiddleName":"","SurName":" Sam-Sumana","PoliticalParty":"Coalition for Change (C4C)","ElectionYear":"2018-03-07","ElectionType":"Presidential","Profile":"\u003Cdiv\u003E\n\u003Cp\u003EAlhaji Samuel Sidique Sam-Sumana (born April 7, 1962) is a Sierra Leonean politician who was the Vice President of Sierra Leone from September 17, 2007 to March 17, 2015. Sam-Sumana stood as the vice-presidential candidate of the All People\u0027s Congress (APC) in the 2007 presidential election, alongside presidential candidate Ernest Bai Koroma. The APC ticket defeated the Sierra Leone People\u0027s Party (SLPP) presidential candidate Solomon Berewa and vice presidential candidate Momodou Koroma. Sam-Sumana took office as Vice President on September 17, 2007.\u003C\/p\u003E\n\u003Cp\u003EOn March 17, 2015, President Koroma sacked Sam-Sumana as Vice President on the grounds that he had abandoned his position and sought asylum in the United States Embassy in Freetown, and for not belonging to a political party [2][3][4][5] although it was reported by several local and international media that Sam-Sumana fled his residence fearing for his life, before soldiers had surrounded his house and disarmed his security team. The Sierra Leone government said Sam-Sumana was not in any danger and that soldiers only came to Sam-Sumana\u0027s house to rotate his security team [6]. President Ernest Bai Koroma sacked Sam-Sumana for also not belonging to a political party, though he was expelled from the APC party by the National Advisory Council of the All People\u0027s Congress on March 6, 2015. Sam-Sumana said his sacking by president Ernest Bai Koroma was unconstitutional and has appealed to the Sierra Leone Supreme Court.\u003C\/p\u003E\n\u003Cp\u003EThe sacking of Sam-Sumana was described as unconstitutional by the main opposition Sierra Leone People\u0027s Party (SLPP), the Sierra Leone Labour Congress, which represent the country\u0027s trade union, and by the Sierra Leone Bar Association, which is made up of many of the country\u0027s lawyers.\u003C\/p\u003E\n\u003Cp\u003EThe APC National Advisory Council expelled Sam-Sumana on accusations of Sam-Sumana allegedly giving false information about his Master\u0027s degree certificate; he was accused of allegedly instigating political violence in Kono District; was accused of allegedly trying to form a breakaway faction of a new political party; and was also accused of allegedly giving false information about his religion. Sam-Sumana denied all the allegations against him and has appealed his sacking as vice president. Sam-Sumana denied all the allegations against him; and described them as completely wrong and baseless .\u003C\/p\u003E\n\u003Cp\u003ESam-Sumana served as the managing director of the United Diamond Mining Company based in Koidu Town, Kono District, Sierra Leone. He also served as the regional manager for C-12 International, a Texas based mining company engaged in diamond production in Sierra Leone, Guinea and Liberia.\u003C\/p\u003E\n\u003Cp\u003ESam-Sumana is a devout Muslim and a member of the Kono ethnic group.[6] Sam-Sumana is married to Khadija Sam-Sumana. The couple resided in Minnesota in the United States, but returned to Freetown in 2007 when Sam-Sumana was named as running mate by opposition leader Ernest Bai Koroma on the ticket of the All People\u0027s Congress (APC).\u003C\/p\u003E\n\u003Cp\u003ESam Sumana is now the Leader and flag bearer of the Coalition For Change or C4C, a progressive Political party in Sierra Leone. He will be contesting in the 2018 General elections of the Country on 7th March, 2018.\u003C\/p\u003E\n\u003C\/div\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/samuel-sam-sumana.jpg","CandidateSLEOP_UUID":"3d1fc2e0-18bd-4127-9b06-6ac93cb32a37","CandidateFullname":"Samuel Sam-Sumana","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"321","FirstName":"Zainab","MiddleName":"","SurName":"Bangura","PoliticalParty":"Movement for Progress (MOP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"\u003Cp\u003E\u003Cstrong\u003EHaja Zainab Hawa Bangura\u003C\/strong\u003E (born 18 December 1959) is a Sierra Leonean politician and social activist who has been serving as the Director-General of the United Nations Office at Nairobi (UNON) since 2018, appointed by United Nations Secretary-General António Guterres. She served as the second United Nations Special Representative on Sexual Violence in Conflict with the rank of Under-Secretary-General of the United Nations from 2012 to 2017, in succession to the first holder of the post, Margot Wallström. In 2017 she was succeeded by Pramila Patten.\u003C\/p\u003E\n\u003Cp\u003EIn 2007, Bangura became Sierra Leone\u0027s foreign minister in the government of President Ernest Bai Koroma of the All People\u0027s Congress (APC) Party. She was the second woman to serve in that post, following Shirley Gbujama who held that position from 1996 to 1997. She served as Minister of Health and Sanitation from 2010 to 2012.\u003C\/p\u003E\n\u003Ch5\u003EEarly life\u003C\/h5\u003E\n\u003Cp\u003EThe daughter of an imam, Zainab Hawa Bangura was born \u0022Zainab Hawa Sesay\u0022 in the small rural town of Yonibana, Tonkolili District in the Northern Province of British Sierra Leone.[citation needed] She hails from the Temne ethnic group. She was born into a family of limited means, and she attended secondary school on a scholarship that was awarded to her by the Mathora Girls Secondary School near Magburaka. She later attended the Annie Walsh Girls Secondary School in the capital city of Freetown.\u003C\/p\u003E\n\u003Cp\u003EThen, after graduating from Sierra Leone\u0027s Fourah Bay College, Bangura moved to the United Kingdom for advanced diplomas in Insurance Management at the City University Business School of London and the University of Nottingham. While in her early 30s, she became vice-president of one of her country\u0027s largest insurance companies.\u003C\/p\u003E\n\u003Cp\u003EBangura speaks three languages: Temne, Krio, and English.\u003C\/p\u003E\n\u003Ch5\u003EPublic life\u003C\/h5\u003E\n\u003Ch6\u003EEarly activism\u003C\/h6\u003E\n\u003Cp\u003EBangura became a social activist during the difficult period when Sierra Leone was ruled by the NPRC military junta. She began with consciousness-raising efforts among urban market women, reminding her followers that her own mother was a market woman. In 1994 she founded Women Organized for a Morally Enlightened Nation (W.O.M.E.N.), the first non-partisan women\u0027s rights group in the country. The following year she co-founded the Campaign for Good Governance (CGG). Then, using CGG as her platform, she campaigned for the holding of national elections that finally drove the NPRC from power in 1996 and restored democratic government. This was Sierra Leone\u0027s first democratic election in 25 years, and the Sierra Leonean media and the general public attributed that success largely to her efforts.\u003C\/p\u003E\n\u003Cp\u003EDuring Sierra Leone\u0027s civil war (1991–2002) Bangura spoke out forcefully against the atrocities committed against the civilian population by the Revolutionary United Front (RUF) and was targeted for assassination several times by that group. She also spoke against the corruption in the civilian government of President Ahmad Tejan Kabbah and the atrocities committed against civilians by government soldiers. In June 1997, as fighting engulfed the country, Bangura fled on a fishing boat to neighboring Guinea.\u003C\/p\u003E\n\u003Ch6\u003EPolitical career\u003C\/h6\u003E\n\u003Cp\u003EIn the 2002 elections, Bangura ran against Kabbah for the presidency of Sierra Leone, departing for the first time from her accustomed role as a non-partisan civil society activist. She won less than one percent of the vote, and her Movement for Progress (MOP) party failed to gain any seats in Sierra Leone\u0027s parliament. Bangura claimed that her party\u0027s low vote count resulted from corruption in the voting system.\u003C\/p\u003E\n\u003Cp\u003EAfter the 2002 elections Bangura founded the National Accountability Group (NAG) whose mission was to fight against official corruption and to promote transparency and accountability in government. In 2006 she left Sierra Leone for neighbouring Liberia where she was appointed Director of the Civil Affairs Office in the United Nations Mission in Liberia (UNMIL) and given responsibility for the reconstruction of 16 Liberian ministries and 30 government agencies following that country\u0027s devastating civil war.\u003C\/p\u003E\n\u003Cp\u003EBangura returned to Sierra Leone in 2007 after Ernest Bai Koroma won the presidency in a hard-fought national election and was named foreign minister shortly thereafter. At the time, many Sierra Leoneans believed that the new president elevated this well known critic of government to such a high position to demonstrate his good faith in promising reform.\u003C\/p\u003E\n\u003Cp\u003EAs a devoted Muslim, Bangura took time off politics in 2009 to travel to the Holy city of Mecca in Saudi Arabia to participate in the 2009 Hajj pilgrimage ceremony.\u003C\/p\u003E\n\u003Ch6\u003ECareer in international politics\u003C\/h6\u003E\n\u003Cp\u003EIn 2012, Bangura served on the United Nations Commission on Life-Saving Commodities, which was jointly chaired by Goodluck Jonathan and Jens Stoltenberg, and issued recommendations to increase access to and use of 13 essential commodities for women’s and children’s health.\u003C\/p\u003E\n\u003Cp\u003EBangura subsequently assumed her next position as Special Representative of the Secretary-General on Sexual Violence in Conflict at the level of Under-Secretary-General on 4 September 2012. In this capacity, she also chaired the interagency network UN Action Against Sexual Violence in Conflict. During her time in office, she helped launch an international protocol in 2014 for dealing with rape and sexual violence in conflict, providing guidelines on the investigation of sex crimes and the collection of evidence for future prosecutions.[13] She notably negotiated a June 2015 deal with military commanders in Ivory Coast to prosecute soldiers accused of sexual violence.[14] That same year, she visited Iraq and Syria and worked on an action plan to address the sexual violence being waged by Islamic State of Iraq and the Levant (ISIS) fighters.\u003C\/p\u003E\n\u003Cp\u003EFrom 2018 until 2019, Bangura co-chaired (alongside Katherine Sierra) an Independent Commission on Sexual Misconduct, Accountability and Culture Change at Oxfam. In 2019, Guterres appointed her as Director-General of the United Nations Office at Nairobi, succeeding Maimunah Mohd Sharif.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/zainab-hawa-bangura.jpg","CandidateSLEOP_UUID":"7a0bd9c4-806d-4ead-9dda-e6e431b1bdb0","CandidateFullname":"Zainab Bangura","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Female","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"39","FirstName":"Desmond","MiddleName":"","SurName":"Luke","PoliticalParty":"National Unity Movement (NUM)","ElectionYear":"1996-02-27","ElectionType":"Presidential","Profile":"\u003Cp\u003EDesmond Edgar Fashole Luke (6 October 1935 – 27 February 2021) was a former politician and lawyer in Sierra Leone. Luke served as foreign minister (1973–75), Minister of Health (1977–78), and ambassador to the West Germany (1969–73), France (1971–73) and the European Economic Community (1971–73) at various points in his political career. Luke competed in the 1996 presidential election against several other candidates, eventually losing to current President Ahmed Tejan Kabbah after only receiving 1.1% of the vote in the initial round of voting. In March 1998, Luke was appointed to replace Samuel Beccles-Davies as Chief Justice of the Supreme Court.[2] Luke retired from that position in 2002. He was an alumnus of Cambridge University and Oxford University. Luke was a strong supporter of Kabbah\u0027s government-in-exile after the 1997 coup by Johnny Paul Koroma.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EEarly life and education\u003C\/strong\u003E\u003Cbr \/\u003EA member of the Creole ethnic group, Desmond Edgar Fashole Luke was born in Freetown, British Sierra Leone, in 1935 into a high-achieving family. His father, Sir Emile Fashole Luke was until 1973 Speaker of the House of Representatives in Sierra Leone.[4] Desmond Luke attended the Prince of Wales Secondary School in Freetown for two years, before going to England in 1949 to continue his education at King\u0027s College, Taunton, Somerset. From 1954 to 1958 he studied at Keble College, Oxford University, earning a degree in Philosophy, Politics and Economics in 1957, but staying for a further year to study West African medieval history under the historian Thomas Hodgkin. Luke continued his studies at Magdalene College, Cambridge University (1959–61), earning an MA in Law.\u003C\/p\u003E\n\u003Cp\u003E\u003Cstrong\u003EPolitical career\u003C\/strong\u003E\u003Cbr \/\u003EReturning to Sierra Leone in 1962, he set up law chambers in Freetown and was in private practice until 1969,[3] when Siaka Stevens appointed him Ambassador to West Germany (accredited to all EU countries). In 1973, Luke was appointed Foreign Minister, which post he held for two years.[1] He subsequently held the post of Minister of Health for a year (1977–78), after which he left the government though remained in Parliament until 1983. He later set up the National Unity Movement (NUM), to advocate constitutional reforms, and under the NUM banner contested, and lost, the 1996 elections. He was appointed Chief Justice in 1998, from which position he retired in 2002.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"7a9b8be2-d5c9-414a-8d65-9de7548d92e3","CandidateFullname":"Desmond Luke","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"85","FirstName":"Charles","MiddleName":"Francis Kondo","SurName":"Margai","PoliticalParty":"Peoples Movement for Democratic Change (PMDC)","ElectionYear":"2023-06-24, 2018-03-07, 2012-11-17, 2007-08-11","ElectionType":"Presidential","Profile":"\u003Cp\u003ECharles Francis Kondo Margai (born 19 August 1945[1]) is a Sierra Leonean lawyer and politician. He is the leader of the People\u0027s Movement for Democratic Change (PMDC), the third major political party in Sierra Leone, after the big two, the Sierra Leone People\u0027s Party (SLPP) and the All People\u0027s Congress (APC). He was his party\u0027s candidate in the August 2007 presidential election, placing third with 10% of the vote. He is the son of former Sierra Leone\u0027s Prime Minister Albert Margai and the nephew of Sierra Leone\u0027s first Prime Minister Milton Margai.\u003C\/p\u003E\n\u003Cp\u003EMargai began working as a lawyer in 1971 as State Counsel in Freetown. He later opened his private law office in 1973 in Bo.\u003C\/p\u003E\n\u003Cp\u003EMargai was a member of the Sierra Leone People\u0027s Party (SLPP), which was co-founded in 1951 by his uncle Milton Margai. Both his father and his uncle had been leaders of the SLPP. In 1996 Charles Margai sought the nomination to stand as the party\u0027s candidate in the 1996 presidential elections. When he failed to secure the nomination he left the SLPP\u003C\/p\u003E\n\u003Cp\u003EIn the aftermath of Margai\u0027s failure to become the SLPP presidential candidate, he joined the National Unity Party and ran in the 1996 parliamentary election\u003C\/p\u003E\n\u003Cp\u003EHe subsequently returned to the SLPP and in April 1998, Margai became Minister of Internal Affairs and Local Government following the restoration of President Ahmed Tejan Kabbah;[5][6] From November 1999 he was Minister of Safety and Security.\u003C\/p\u003E\n\u003Cp\u003EOn 6 January 2002, Kabbah requested that Margai clarify reports that the latter planned to seek the SLPP party leadership, which was held by Kabbah. Margai resigned as a minister on 8 January 2002 following a meeting with Kabbah, in which Kabbah expressed concern that the country might appear unstable and might therefore receive less aid from abroad.\u003C\/p\u003E\n\u003Cp\u003EOn 9 January, Margai confirmed his plans to seek the leadership of the SLPP and its presidential nomination, describing himself as the best person for the position and saying that he had resigned from the cabinet \u0022in the interest of good governance and for the people of this nation\u0022 due to \u0022mistrust\u0022 between himself and Kabbah.[8]\u003C\/p\u003E\n\u003Cp\u003EOn 8 March, however, the High Court ruled that he was not technically a member of the SLPP, preventing him from seeking the nomination, which was won by Kabbah.[4]\u003C\/p\u003E\n\u003Cp\u003EMargai was President of the Sierra Leone Bar Association from 2004 to 2005.[1]\u003C\/p\u003E\n\u003Cp\u003EMargai again unsuccessfully sought the SLPP presidential nomination at the party\u0027s national convention in Makeni on 3–4 September 2005; he received second place, with 34 votes, far behind Vice-President Solomon Berewa, who received 291 votes.\u003C\/p\u003E\n\u003Cp\u003EIn early October 2005, he broke with the SLPP to form a new party, the People\u0027s Movement for Democratic Change. Margai faced difficulty in getting the PMDC officially registered, which he alleged was due to Kabbah deliberately delaying appointments to the Political Parties Commission which would enable the registration, thereby giving Berewa\u0027s campaign an advantage in time.\u003C\/p\u003E\n\u003Cp\u003EThe PMDC was officially registered on 19 January 2006.\u003C\/p\u003E\n","CandidatePhoto":"\/sites\/default\/files\/2023-04\/charles-francis-margai.jpg","CandidateSLEOP_UUID":"54b03b01-ae07-4638-aba4-6044068d2d15","CandidateFullname":"Charles Francis Kondo Margai","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""},{"CandidateSLEOP_ID":"322","FirstName":"Raymond","MiddleName":"Bamidele","SurName":"Thompson","PoliticalParty":"Citizens United for Peace and Progress (CUPP)","ElectionYear":"2002-05-14","ElectionType":"Presidential","Profile":"","CandidatePhoto":"\/sites\/default\/files\/default_images\/sloedp-ai-generated-male-profile-photo-2.png","CandidateSLEOP_UUID":"fca4e8ae-9970-4d96-885d-a29baa03fc45","CandidateFullname":"Raymond Bamidele Thompson\t","ElectionDistrict":"","ElectionCityCouncil":"","ElectionLocality":"","ElectionConstituency":"","ElectionWard":"","CandidateContact":"","CandidateEducation":"","CandidateEmail":"","CandidateGender":"Male","CandidateSkills":"","CandidateWebsite":""}]